ERP DEV.WMS/src/Catalogs/вмс_НастройкиОператора/вмс_НастройкиОператора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НастройкиОператора</name>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиФорм</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаОтветственногоХранения</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьКоличествоРаспоряжений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРучнойВвод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разработчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвуковаяСхема</name>
    <type>
      <types>CatalogRef.вмс_Звуки</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПрисвоениеШтрихкода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МасштабФормы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
    <attributes>
      <name>МастерОперация</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ТипПринтера</name>
      <type>
        <types>EnumRef.ТипыПринтеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКомпьютера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКПринтеру</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>CatalogRef.вмс_Принтеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ячейки</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Помещения</name>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.вмс_Помещения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Enums/ТипыПринтеров/ТипыПринтеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПринтеров</name>
  <enumValues>
    <name>ЛокальныйПринтер</name>
  </enumValues>
  <enumValues>
    <name>БеспроводнойПринтер</name>
  </enumValues>
  <enumValues>
    <name>СерверныйПринтер</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/Catalogs/вмс_Звуки/вмс_Звуки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_Звуки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Схема</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_Операции/вмс_Операции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_Операции</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДанныеСКД</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеКладовщикуРаспоряжение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиватьУслугиХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассОперацииХранилище</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяФорма</name>
    <type>
      <types>CatalogRef.вмс_ИнтерфейсыТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаВФормеСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоРаспоряжению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поток</name>
    <type>
      <types>EnumRef.вмс_СкладскиеПотоки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредопределенныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазбиватьПоПомещениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДДокументы</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДЗаданияКладовщику</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИнвентаризация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДанныеСКД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКлассОперацииХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДДокументы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДЗаданияКладовщику</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Распоряжения</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаРаспоряжение</name>
      <type>
        <types>CatalogRef.вмс_РаспоряженияОпераций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыОперации</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.вмс_ЭтапыОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.вмс_СтатусыДокументов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваОперации</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_СвойстваОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтветственноеХранение</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_УслугиОтветственногоХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПочтовыеРассылки</name>
    <attributes>
      <name>Рассылка</name>
      <type>
        <types>CatalogRef.вмс_ПочтовыеРассылки</types>
      </type>
    </attributes>
    <attributes>
      <name>Активная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Алгоритмы</name>
    <attributes>
      <name>Алгоритм</name>
      <type>
        <types>CatalogRef.вмс_Алгоритмы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриСохранении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриЗавершении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоКонвертации</name>
      <type>
        <types>CatalogRef.вмс_ПравилаКонвертацииРеквизитов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбработкиПередЗавершением</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Обработка</name>
      <type>
        <types>CatalogRef.вмс_ИнтерфейсыТСД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперацииПлана</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОперации</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаФронтенде</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаБэкенде</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормыОперации</name>
    <attributes>
      <name>МакетФормы</name>
      <type>
        <types>CatalogRef.вмс_ИнтерфейсыТСД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МетодыОперации</name>
    <attributes>
      <name>ИмяМетода</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормыKPI</name>
    <attributes>
      <name>КоличествоМинут</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЕдиниц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>EnumRef.вмс_ЕдиницыИзмеренияKPI</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_НастройкиОператора/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

 &НаКлиенте
Перем ПеременныеКлиент;

#КонецОбласти

#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Объект.ЗвуковаяСхема = Справочники.вмс_Звуки.СтандартнаяСхема();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Инициализация();
	ЗаполнитьСписокОперацийФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Инициализация()
	
	ПеременныеКлиент = Новый Структура;
	ПеременныеКлиент.Вставить("ПустаяОперация", ПредопределенноеЗначение("Справочник.вмс_Операции.ПустаяСсылка"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЗаполнитьСписокОперацийОбъекта();
	
	ВИП_Настройка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПроигратьЗвукНачало();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокОпераций

&НаКлиенте
Процедура СписокОперацийПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не ОтменаРедактирования Тогда
		
		СтрокаРодитель = Элемент.ТекущиеДанные;
		
		Если СтрокаРодитель.Операция <> ПеременныеКлиент.ПустаяОперация Тогда
			
			ПодчиненныеОперации = ПолучитьПодчиненныеОперации(СтрокаРодитель.Операция);

			Если НоваяСтрока Тогда
				
				ЗаполнитьСписокОперацийФормы(СтрокаРодитель, ПодчиненныеОперации);
				
			ИначеЕсли ПодчиненныеОперации.Количество() > 0 Тогда
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("СтрокаРодитель", СтрокаРодитель);
				ДополнительныеПараметры.Вставить("ПодчиненныеОперации", ПодчиненныеОперации);
				ОО = Новый ОписаниеОповещения("ОбработчикОтветаНаВопросДобавитьПодчиненныеОперации", ЭтаФорма, ДополнительныеПараметры);
				ПоказатьВопрос(ОО, "Добавить подчиненные операции?", РежимДиалогаВопрос.ДаНет);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Функция ОбработчикОтветаНаВопросДобавитьПодчиненныеОперации(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьСписокОперацийФормы(ДополнительныеПараметры.СтрокаРодитель, ДополнительныеПараметры.ПодчиненныеОперации);

	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СписокОперацийПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	МассивОбновляемыхСтрок = Новый Массив;
	
	НовыйРодитель = СписокОпераций.НайтиПоИдентификатору(Строка);
	МассивОбновляемыхСтрок.Добавить(НовыйРодитель);

	ПеремещаемыеСтроки = Новый Массив;
	Для Каждого ИдентификаторСтроки Из ПараметрыПеретаскивания.Значение Цикл
		Строка = СписокОпераций.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаРодителя = Строка.ПолучитьРодителя();
		ПеремещаемыеСтроки.Добавить(Строка);
		МассивОбновляемыхСтрок.Добавить(СтрокаРодителя);
	КонецЦикла;
	
	НовыеСтроки = ПереместитьСтрокиДерева(НовыйРодитель, ПеремещаемыеСтроки);
	
	Для Каждого Строка Из НовыеСтроки Цикл
		МассивОбновляемыхСтрок.Добавить(Строка);
	КонецЦикла;
	
	ОбновитьСтрокиСпискаОпераций(МассивОбновляемыхСтрок);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПринтеры 

&НаКлиенте
Процедура ПринтерыТипПринтераПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Принтеры.ТекущиеДанные;
	Если ТекСтрока <> Неопределено И ТекСтрока.ТипПринтера = ЭтоЛокальныйПринтер() Тогда
		Элементы.Принтеры.ТекущиеДанные.ИмяКомпьютера = вмс_ПараметрыПриложения["ИмяКомпьютера"];	
	КонецЕсли;
	
КонецПроцедуры

// ТУ_Самойленко 10.08.23 ++
&НаКлиенте
Процедура ПринтерыПоУмолчаниюПриИзменении(Элемент)
	
	Если Элементы.Принтеры.ТекущиеДанные.ПоУмолчанию Тогда
		
		Строки = Объект.Принтеры.НайтиСтроки(Новый Структура("ПоУмолчанию", Истина));
		
		Для Каждого Строка Из Строки Цикл
			Если ОдинаковыеФорматыПечати(Строка.Принтер, Элементы.Принтеры.ТекущиеДанные.Принтер) Тогда
				Строка.ПоУмолчанию = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Элементы.Принтеры.ТекущиеДанные.ПоУмолчанию = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы 

// Плугина 20.09 +
&НаКлиенте
Процедура ЯчейкиПодбор(Команда) 
	
	ОбработчикВыбора = Новый ОписаниеОповещения("Обработчик_ПодборЯчеек", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура(); 
	ПараметрыФормы.Вставить("МножественныйВыбор",		Истина);
	ПараметрыФормы.Вставить("РежимВыбора",				Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе" ,		Истина);
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов",		ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	ПараметрыФормы.Вставить("ОтображениеТаблицы",		ОтображениеТаблицы.Дерево);
	
	ОткрытьФорму("Справочник.вмс_МестаХранения.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , ,ОбработчикВыбора);
	
КонецПроцедуры

&НаКлиенте
Функция Обработчик_ПодборЯчеек(ВыбранныеЯчейки, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеЯчейки <> Неопределено Тогда
		Для Каждого Ячейка Из ВыбранныеЯчейки Цикл 
			ДобавитьЯчейкуВДоступныеЯчейки(Ячейка);
		КонецЦикла
	КонецЕсли;
	
КонецФункции 

&НаКлиенте
Процедура ДобавитьЯчейкуВДоступныеЯчейки(ВыбранныйЭлемент)
	
	Если ЭтоГруппаЯчеек(ВыбранныйЭлемент) Тогда
		ДобавитьЯчейкиГруппыВДоступныеЯчейки(ВыбранныйЭлемент);
	Иначе
		Ячейка = Объект.Ячейки.НайтиСтроки(Новый Структура("Ячейка", ВыбранныйЭлемент));
		Если Ячейка.Количество() = 0 Тогда
			НоваяСтрока = Объект.Ячейки.Добавить();
			НоваяСтрока.Ячейка = ВыбранныйЭлемент; 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЯчейкиГруппыВДоступныеЯчейки(Группа)
	
	ЯчейкиВыбраннойГруппы = ПолучитьЯчейкиПоРодителю(Группа);
	
	Для каждого Ячейка Из ЯчейкиВыбраннойГруппы Цикл
		ДобавитьЯчейкуВДоступныеЯчейки(Ячейка);
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПомещенияПодбор(Команда)
	
	ОбработчикВыбора = Новый ОписаниеОповещения("Обработчик_ПодборПомещений", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура(); 
	ПараметрыФормы.Вставить("МножественныйВыбор",		Истина);
	ПараметрыФормы.Вставить("РежимВыбора",				Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе" ,		Истина);
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов",		ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	ПараметрыФормы.Вставить("ОтображениеТаблицы",		ОтображениеТаблицы.Дерево);
	
	ОткрытьФорму("Справочник.вмс_Помещения.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , ,ОбработчикВыбора);
	
КонецПроцедуры 

&НаКлиенте
Функция Обработчик_ПодборПомещений(ВыбранныеПомещения, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеПомещения <> Неопределено Тогда
		
		Для каждого Помещение Из ВыбранныеПомещения Цикл  
			НужноДобавить = Объект.Помещения.НайтиСтроки(Новый Структура("Помещение", Помещение)).Количество() = 0;
			Если НужноДобавить Тогда
				НоваяСтрока = Объект.Помещения.Добавить();
				НоваяСтрока.Помещение = Помещение;	
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции 

#КонецОбласти 



#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВИП_Настройка()
	
	ЗащищенныйМодуль = Обработки.вмс_ЗащищенныйМодуль.Создать();
	Если НЕ ЗащищенныйМодуль.ЭтоВИП(Строка(Объект.Оператор)) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗвуковаяСхемаВИП = Справочники.вмс_Звуки.Схема("ВИП");
	Если НЕ ЗначениеЗаполнено(ЗвуковаяСхемаВИП) Тогда
		ЗащищенныйМодуль.ЗагрузитьЗвуковуюСхемуВИП();
		ЗвуковаяСхемаВИП = Справочники.вмс_Звуки.Схема("ВИП");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗвуковаяСхемаВИП) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Объект.ЗвуковаяСхема = ЗвуковаяСхемаВИП;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПроигратьЗвукНачало()
	
	ИмяСхемы = вмс_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(Объект.ЗвуковаяСхема, "Имя");
	Если ЗначениеЗаполнено(ИмяСхемы) Тогда
		вмс_РаботаСоЗвукомКлиент.ПроигратьЗвук(ИмяСхемы + "\Начало");
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьСписокОперацийФормы(знач СтрокаРодитель=Неопределено, знач ПодчиненныеОперации=Неопределено)
	
	Если СтрокаРодитель = Неопределено Тогда
		МастерОперация = ПеременныеКлиент.ПустаяОперация;
		СтрокаРодитель = СписокОпераций;
	Иначе
		МастерОперация = СтрокаРодитель.Операция;
	КонецЕсли;
	
	Если ПодчиненныеОперации = Неопределено Тогда
		ПодчиненныеОперации = Объект.Операции;
	КонецЕсли;
	
	СтрокиСпискаПоОперациям = Новый Соответствие;
	СтрокиСпискаПоОперациям[МастерОперация] = СтрокаРодитель;

	СтрокаРодитель.ПолучитьЭлементы().Очистить();
	
	МассивОбновляемыхСтрок = Новый Массив;
	МассивОбновляемыхСтрок.Добавить(СтрокаРодитель);
	
	Для Каждого СтрокаОперации Из ПодчиненныеОперации Цикл
		СтрокаРодитель = СтрокиСпискаПоОперациям[СтрокаОперации.МастерОперация];
		Если СтрокаРодитель = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСписка = СтрокаРодитель.ПолучитьЭлементы().Добавить();
		СтрокаСписка.Операция = СтрокаОперации.Операция;
		
		СтрокиСпискаПоОперациям[СтрокаСписка.Операция] = СтрокаСписка;
		МассивОбновляемыхСтрок.Добавить(СтрокаСписка);
	КонецЦикла;
	
	ОбновитьСтрокиСпискаОпераций(МассивОбновляемыхСтрок);
	
КонецФункции

&НаКлиенте
Функция ОбновитьСтрокиСпискаОпераций(Строки)
	
	Для Каждого Строка Из Строки Цикл
		
		Если Строка = СписокОпераций Тогда
			Продолжить;
		КонецЕсли;
		
		Строка.ЭтоГруппа = Строка.ПолучитьЭлементы().Количество() > 0;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьСписокОперацийОбъекта()
	
	Объект.Операции.Очистить();
	
	ОбходСтрокСписка = Новый Массив;
	ОбходСтрокСписка.Добавить(СписокОпераций);
	
	Для Каждого СтрокаРодитель Из ОбходСтрокСписка Цикл
		
		Если СтрокаРодитель = СписокОпераций Тогда
			МастерОперация = ПеременныеКлиент.ПустаяОперация;
		Иначе
			МастерОперация = СтрокаРодитель.Операция;
		КонецЕсли;
		
		Для Каждого СтрокаСписка Из СтрокаРодитель.ПолучитьЭлементы() Цикл
			
			Операция = СтрокаСписка.Операция;
			Если Объект.Операции.НайтиСтроки(Новый Структура("Операция", Операция)).Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаОперации = Объект.Операции.Добавить();
			СтрокаОперации.Операция = Операция;
			СтрокаОперации.МастерОперация = МастерОперация;
			
			ОбходСтрокСписка.Добавить(СтрокаСписка);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПодчиненныеОперации(МастерОперации)

	РК = вмс_РаботаСКоллекциями;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_Операции.Ссылка КАК Операция,
	|	вмс_Операции.Родитель КАК МастерОперация
	|ИЗ
	|	Справочник.вмс_Операции КАК вмс_Операции
	|ГДЕ
	|	вмс_Операции.Родитель В(&МастерОперации)
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	МастерОперацииУровня = МастерОперации;
	
	ТаблицаОпераций = РК.НоваяТаблицаЗначений("Операция, МастерОперация");
	
	Пока Истина Цикл
		Запрос.УстановитьПараметр("МастерОперации", МастерОперацииУровня);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		ТаблицаОперацийУровня = РезультатЗапроса.Выгрузить();
		РК.ДобавитьЭлементыКоллекции(ТаблицаОпераций, ТаблицаОперацийУровня);
		
		МастерОперацииУровня = ТаблицаОперацийУровня.ВыгрузитьКолонку("Операция");
		
	КонецЦикла;
	
	ТаблицаОперацийДляКлиента = РК.ВыгрузитьКоллекциюВМассивСтруктур(ТаблицаОпераций);
	
	Возврат ТаблицаОперацийДляКлиента;

КонецФункции

&НаКлиенте
Функция ПереместитьСтрокиДерева(СтрокаНовогоРодителя, ПеремещаемыеСтроки)
	
	Если ТипЗнч(ПеремещаемыеСтроки) <> Тип("Массив") Тогда
		Строка = ПеремещаемыеСтроки;
		ПеремещаемыеСтроки = Новый Массив;
		ПеремещаемыеСтроки.Добавить(Строка);
	КонецЕсли;
	
	МассивНовыхСтрок = СкопироватьСтрокиДерева(СтрокаНовогоРодителя, ПеремещаемыеСтроки);
	
	Для Каждого Строка Из ПеремещаемыеСтроки Цикл
		СтрокаРодитель = Строка.ПолучитьРодителя();
		СтрокаРодитель.ПолучитьЭлементы().Удалить(Строка);
	КонецЦикла;
	
	Возврат МассивНовыхСтрок;
	
КонецФункции

&НаКлиенте
Функция СкопироватьСтрокиДерева(СтрокаНовогоРодителя, знач КопируемыеСтроки)
	
	Если ТипЗнч(КопируемыеСтроки) <> Тип("Массив") Тогда
		Строка = КопируемыеСтроки;
		КопируемыеСтроки = Новый Массив;
		КопируемыеСтроки.Добавить(Строка);
	КонецЕсли;

	СоответствияСтрок = Новый Соответствие;
	ОбходСтрок = Новый Массив;
	Для Каждого Строка Из КопируемыеСтроки Цикл
		СтрокаПредыдущегоРодителя = Строка.ПолучитьРодителя();
		СоответствияСтрок[СтрокаПредыдущегоРодителя] = СтрокаНовогоРодителя;
		ОбходСтрок.Добавить(Строка);
	КонецЦикла;
	
	МассивНовыхСтрок = Новый Массив;
	Для Каждого Строка Из ОбходСтрок Цикл
		СтрокаПредыдущегоРодителя = Строка.ПолучитьРодителя();
		СтрокаРодителя = СоответствияСтрок[СтрокаПредыдущегоРодителя];
		НоваяСтрока = СтрокаРодителя.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		СоответствияСтрок[Строка] = НоваяСтрока;
		МассивНовыхСтрок.Добавить(НоваяСтрока);
		Для Каждого ПодчиненнаяСтрока Из Строка.ПолучитьЭлементы() Цикл
			ОбходСтрок.Добавить(ПодчиненнаяСтрока);
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивНовыхСтрок;
	
КонецФункции

&НаКлиенте
Функция ЭтоЛокальныйПринтер()
	Возврат ПредопределенноеЗначение("Перечисление.ТипыПринтеров.ЛокальныйПринтер");
КонецФункции

&НаСервере
Функция ОдинаковыеФорматыПечати(Принтер1, Принтер2)
	Возврат Принтер1.ФорматПечати = Принтер2.ФорматПечати
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЯчейкиПоРодителю(Родитель)
	Возврат Справочники.вмс_МестаХранения.ПолучитьЯчейкиПоРодителю(Родитель);
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоГруппаЯчеек(Ячейка)
	// TODO: 231023843 Неоптимально. Переделать на разовое получение групп
	Возврат Ячейка.ЭтоГруппа;
КонецФункции

&НаСервере
Процедура ДобавитьВсеОперацииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вмс_Операции.Ссылка КАК Операция,
	|	вмс_Операции.Родитель КАК МастерОперация
	|ИЗ
	|	Справочник.вмс_Операции КАК вмс_Операции
	|ГДЕ
	|	вмс_Операции.ПометкаУдаления = ЛОЖЬ
	|УПОРЯДОЧИТЬ ПО
	|	вмс_Операции.Код ВОЗР";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Объект.Операции.Очистить(); 
	
	Пока Выборка.Следующий() Цикл
    	НоваяСтрока = Объект.Операции.Добавить();
		НоваяСтрока.Операция = Выборка.Операция;
		НоваяСтрока.МастерОперация = Выборка.МастерОперация;
	КонецЦикла;  
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВсеОперации(Команда)
	ДобавитьВсеОперацииНаСервере(); 
	ЗаполнитьСписокОперацийФормы();
КонецПроцедуры

#КонецОбласти
